# List მაგალითი
my_list = [1, 2, 3, 'a', 'b', 'c']  # ელემენტების სია, რომლის ცვლილებაც შესაძლებელია
my_list.append(4)  # სიაში ახალი ელემენტის დამატება
my_list[0] = 'შეცვლილია'  # პირველი ელემენტის შეცვლა

print("List:", my_list)  # List: ['შეცვლილია', 2, 3, 'a', 'b', 'c', 4]

# Tuple მაგალითი
my_tuple = (1, 2, 3, 'a', 'b', 'c')  # ელემენტების ტიუპლი, რომლის ცვლილება არ არის შესაძლებელი
# my_tuple[0] = 'შეცვლილია'  # ეს კოდი შეცდომას გამოიწვევს, რადგან ტიუპლი უცვლელია

print("Tuple:", my_tuple)  # Tuple: (1, 2, 3, 'a', 'b', 'c')

# Set მაგალითი
my_set = {1, 2, 3, 'a', 'b', 'c'}  # ელემენტების მრავლობა, სადაც დუბლიკატები არ არის
my_set.add('d')  # ახალ ელემენტს დამატება შესაძლებელია
my_set.update([4, 5, 6])  # მრავალ ელემენტს დამატება

print("Set:", my_set)  # Set: {1, 2, 3, 4, 5, 6, 'b', 'a', 'd', 'c'}


















list1 = [10, 20, 30, 'apple', 'banana', 'cherry']
print("List1:", list1) 


tuple1 = (10, 20, 30, 'apple', 'banana', 'cherry')
print("Tuple1:", tuple1)  


set1 = {10, 20, 30, 'apple', 'banana', 'cherry'}
print("Set1:", set1)  







  # სიაში რაგაცის დამატება შესაძლებელია
 # სიიდან რაღაცის წაშლა შესაძლებელია
  # სიაში ელემენტების დალაგება შესაძლებელია



 # ტიუპლში რაგაცის ინდექსის პოვნა შესაძლებელია
 # ტიუპლში რაღაცის რაოდენობის გამოთვლა შესაძლებელია
#  - ტიუპლში ელემენტის დამატება შეუძლებელია
#  - ტიუპლიდან ელემენტის წაშლა შეუძლებელია
# - ტიუპლში ელემენტების დალაგება შეუძლებელია


# Set მაგალითი

  # სეტში  დამატება შესაძლებელია
  # სეტიდან  წაშლა შესაძლებელია

#  - სეტში ელემენტების დალაგება შეუძლებელია
# სეტში- მრავლობაში ელემენტის ინდექსის პოვნა შეუძლებელია