// let ცვლადები შეიძლება შეიცვალოს და შეიძლება ხელახლა განსაზღვრული იყოს, მაგრამ მხოლოდ მათ ბლოკში, სადაც ისინი განისაზღვრა.
let name = "სალომე"; 
let age = 10; 
let profession = "Web delevloper" 
// const ცვლადები განისაზღვრება ერთხელ და მათი მნიშვნელობები არ შეიძლება შეიცვალოს.
const birthPlace = "tbilisi"; 
const birthDate = "17.04.2014"; 
const favoriteColor = "შავი"; 

// let: გამოიყენება ცვლადი, რომლის მნიშვნელობა შეიძლება შეიცვალოს.
name = "ბეჟან"; 
age = 30; 


// განსხვავება let და const-ს შორის:
// let ცვლადებს შეუძლია შეიცვალოს მათი მნიშვნელობა და ისინი შეიძლება განსაზღვრული იყოს ხელახლა, ხოლო const ცვლადებს არ შეუძლია შეიცვალოს მათი მნიშვნელობა და განსაზღვრულია მხოლოდ ერთხელ.
