list1 = [1, 2, 3, 4, 5]
tuple1 = (1, 2, 3, 4, 5)
set1 = {1, 2, 3, 4, 5}



# ელემენტის დამატება
list1.append(6)

# ელემენტის წაშლა
list1.remove(3)

# ელემენტის რედაქტირება
list1[0] = 10




# ელემენტის შეცვლა შეუძლებელია (immutable), ამიტომ tuple1 ვერ შევცვლით.
# მაგალითად, ეს კოდი შეცდომას გამოიწვევს:
# tuple1[0] = 10



# ელემენტის დამატება
set1.add(6)

# ელემენტის წაშლა
set1.remove(3)

set2 = {4, 5, 6, 7, 8}


print(list1)  # [10, 2, 4, 5, 6]
print(tuple1)  # (1, 2, 3, 4, 5)
print(set1)  # {1, 2, 4, 5, 6}



